stress.yml
config:
  target: 'http://127.0.0.1:3005'
  processor: './stressGenerate.js'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - name: 'GET test'
    flow:
    - loop:
      - function: 'generateId'
      - get:
          url: '/api/restaurants/{{ id }}'

  - name: "POST test"
    flow:
      - function: generateData
      - post:
          url: "/api/restaurants"
          json:
            id: "{{ id }}"
            title: "{{ title }}"
            genre: "{{ genre }}"
            price: "{{ price }}"
            description: "{{ description }}"
            recommendRestaurant: "{{ recommendRestaurant }}"
            images: "{{ images }}"